app/controllers/friends_controller.rb

  def create
    # binding.pry
    friend = User.find_by_id(params[:friend_id])
    current_user.friends << friend
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 119]]
INSERT INTO "friends" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 119], ["user_id", 120], ["created_at", "2016-03-18 11:54:47.800935"], ["updated_at", "2016-03-18 11:54:47.800935"]]