app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 10]]
---
  def index
    user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 119]]
---
  def sent
    user = User.find(params[:user_id])