app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # byebug
    if @user.save
---
INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ken123"], ["password", "123"], ["email", "ken@gmail.com"], ["created_at", "2016-03-17 03:25:36.065400"], ["updated_at", "2016-03-17 03:25:36.065400"]]